alibaba/AliOS-Things/platform/mcu/msp432p4xx/ti/devices/msp432p4xx/rom/msp432p401_driverlib_rom_image.c
    __PSSLock();
}


uint_fast8_t PSS_getHighSidePerformanceMode(void)
{
    if (BITBAND_PERI(PSS->rCTL0.r, SVSMHLP_OFS))
        return PSS_NORMAL_PERFORMANCE_MODE;
    else
        return PSS_FULL_PERFORMANCE_MODE;
}


void PSS_enableHighSideMonitor(void)
{
    __PSSUnlock();

    BITBAND_PERI(PSS->rCTL0.r, SVSMHS_OFS) = 1;

    __PSSLock();
}


void PSS_disableHighSideMonitor(void)
{
    __PSSUnlock();

    BITBAND_PERI(PSS->rCTL0.r, SVSMHS_OFS) = 0;

    __PSSLock();
}


void PSS_setHighSideVoltageTrigger(uint_fast8_t triggerVoltage)
{
    __PSSUnlock();

    ASSERT(!(triggerVoltage & 0xF8))

    PSS->rCTL0.b.bSVSMHTH = triggerVoltage & 0x07;

    __PSSLock();
}


uint_fast8_t PSS_getHighSideVoltageTrigger(void)
{
    return PSS->rCTL0.b.bSVSMHTH;
}


void PSS_enableInterrupt(void)
{
    __PSSUnlock();
    BITBAND_PERI(PSS->rIE.r,SVSMHIE_OFS) = 1;
    __PSSLock();
}


void PSS_disableInterrupt(void)
{
    __PSSUnlock();
    BITBAND_PERI(PSS->rIE.r,SVSMHIE_OFS) = 0;
    __PSSLock();
}


uint32_t PSS_getInterruptStatus(void)
{
    return PSS->rIFG.r;
}


void PSS_enableForcedDCDCOperation(void)
{
    __PSSUnlock();

    BITBAND_PERI(PSS->rCTL0.r, DCDC_FORCE_OFS) = 1;

    __PSSLock();
}


void PSS_disableForcedDCDCOperation(void)
{
    __PSSUnlock();

    BITBAND_PERI(PSS->rCTL0.r, DCDC_FORCE_OFS) = 0;

    __PSSLock();

}


void PSS_clearInterruptFlag(void)
{
    __PSSUnlock();
    BITBAND_PERI(PSS->rCLRIFG.r,CLRSVSMHIFG_OFS) = 0;
    __PSSLock();
}


void REF_A_setReferenceVoltage(uint_fast8_t referenceVoltageSelect)
{
    ASSERT(referenceVoltageSelect <= REF_A_VREF2_5V);

    REF_A->rCTL0.r = (REF_A->rCTL0.r &  ~REFVSEL_3) | referenceVoltageSelect;
}


void REF_A_disableTempSensor(void)
{
    BITBAND_PERI(REF_A->rCTL0.r,REFTCOFF_OFS) = 1;
}


void REF_A_enableTempSensor(void)
{
    BITBAND_PERI(REF_A->rCTL0.r,REFTCOFF_OFS) = 0;
}


void REF_A_enableReferenceVoltageOutput(void)
{
    BITBAND_PERI(REF_A->rCTL0.r,REFOUT_OFS) = 1;
}


void REF_A_disableReferenceVoltageOutput(void)
{
    BITBAND_PERI(REF_A->rCTL0.r,REFOUT_OFS) = 0;
}


void REF_A_enableReferenceVoltage(void)
{
    BITBAND_PERI(REF_A->rCTL0.r,REFON_OFS) = 1;
}


void REF_A_disableReferenceVoltage(void)
{
    BITBAND_PERI(REF_A->rCTL0.r,REFON_OFS) = 0;
}


uint_fast8_t REF_A_getBandgapMode(void)
{
    return (REF_A->rCTL0.r & BGMODE);
}


bool REF_A_isBandgapActive(void)
{
    return BITBAND_PERI(REF_A->rCTL0.r,REFBGACT_OFS);
}


bool REF_A_isRefGenBusy(void)
{
    return BITBAND_PERI(REF_A->rCTL0.r,REFGENBUSY_OFS);
}


bool REF_A_isRefGenActive(void)
{
    return BITBAND_PERI(REF_A->rCTL0.r,REFGENACT_OFS);
}


bool REF_A_getBufferedBandgapVoltageStatus(void)
{
    return BITBAND_PERI(REF_A->rCTL0.r,REFBGRDY_OFS);
}


bool REF_A_getVariableReferenceVoltageStatus(void)
{
    return BITBAND_PERI(REF_A->rCTL0.r,REFGENRDY_OFS);
}


void REF_A_setReferenceVoltageOneTimeTrigger(void)
{
    BITBAND_PERI(REF_A->rCTL0.r,REFGENOT_OFS) = 1;
}


void REF_A_setBufferedBandgapVoltageOneTimeTrigger(void)
{
    BITBAND_PERI(REF_A->rCTL0.r,REFBGOT_OFS) = 1;
}


void ResetCtl_initiateSoftReset(void)
{
    RSTCTL->rRESET_REQ.r |= (RESET_KEY | RESET_SOFT_RESET);
}


void ResetCtl_initiateSoftResetWithSource(uint32_t source)
{
    RSTCTL->rSOFTRESET_SET.r |= (source);
}


uint32_t ResetCtl_getSoftResetSource(void)
{
    return RSTCTL->rSOFTRESET_STAT.r;
}


void ResetCtl_clearSoftResetSource(uint32_t mask)
{
    RSTCTL->rSOFTRESET_CLR.r |= mask;
}


void ResetCtl_initiateHardReset(void)
{
    RSTCTL->rRESET_REQ.r |= (RESET_KEY | RESET_HARD_RESET);
}


void ResetCtl_initiateHardResetWithSource(uint32_t source)
{
    RSTCTL->rHARDRESET_SET.r |= (source);
}


uint32_t ResetCtl_getHardResetSource(void)
{
    return RSTCTL->rHARDRESET_STAT.r;
}


void ResetCtl_clearHardResetSource(uint32_t mask)
{
    RSTCTL->rHARDRESET_CLR.r |= mask;
}


uint32_t ResetCtl_getPSSSource(void)
{
    return RSTCTL->rPSSRESET_STAT.r;
}


void ResetCtl_clearPSSFlags(void)
{
    RSTCTL->rPSSRESET_CLR.r |= RSTCTL_PSSRESET_CLR_CLR;
}


uint32_t ResetCtl_getPCMSource(void)
{
    return RSTCTL->rPCMRESET_STAT.r;
}


void ResetCtl_clearPCMFlags(void)
{
    RSTCTL->rPCMRESET_CLR.r |= RSTCTL_PCMRESET_CLR_CLR;
}


void RTC_C_startClock(void)
{
    RTC_C->rCTL0.b.bKEY = RTCKEY_H;
    BITBAND_PERI(RTC_C->rCTL13.r, RTCHOLD_OFS) = 0;
    BITBAND_PERI(RTC_C->rCTL0.r, RTCKEY_OFS) = 0;
}


void RTC_C_holdClock(void)
{
    RTC_C->rCTL0.b.bKEY = RTCKEY_H;
    BITBAND_PERI(RTC_C->rCTL13.r, RTCHOLD_OFS) = 1;
    BITBAND_PERI(RTC_C->rCTL0.r, RTCKEY_OFS) = 0;
}


void RTC_C_setCalibrationFrequency(uint_fast16_t frequencySelect)
{
    RTC_C->rCTL0.b.bKEY = RTCKEY_H;
    RTC_C->rCTL13.r = (RTC_C->rCTL13.r & ~(RTCCALF_3)) | frequencySelect;
    BITBAND_PERI(RTC_C->rCTL0.r, RTCKEY_OFS) = 0;
}


void RTC_C_setCalibrationData(uint_fast8_t offsetDirection,
        uint_fast8_t offsetValue)
{
    RTC_C->rCTL0.b.bKEY = RTCKEY_H;
    RTC_C->rOCAL.r = offsetValue + offsetDirection;
    BITBAND_PERI(RTC_C->rCTL0.r, RTCKEY_OFS) = 0;
}


bool RTC_C_setTemperatureCompensation(uint_fast16_t offsetDirection,
        uint_fast8_t offsetValue)
{
    while (!BITBAND_PERI(RTC_C->rTCMP.r, RTCTCRDY_OFS))
        ;

    RTC_C->rTCMP.r = offsetValue + offsetDirection;

    if (BITBAND_PERI(RTC_C->rTCMP.r, RTCTCOK_OFS))
        return true;
    else
        return false;
}


void RTC_C_initCalendar(const RTC_C_Calendar *calendarTime,
        uint_fast16_t formatSelect)
{
    RTC_C->rCTL0.b.bKEY = RTCKEY_H;

    BITBAND_PERI(RTC_C->rCTL13.r, RTCHOLD_OFS) = 1;

    if (formatSelect)
        BITBAND_PERI(RTC_C->rCTL13.r, RTCBCD_OFS) = 1;
    else
        BITBAND_PERI(RTC_C->rCTL13.r, RTCBCD_OFS) = 0;

    RTC_C->rTIM0.b.bSEC = calendarTime->seconds;
    RTC_C->rTIM0.b.bMIN = calendarTime->minutes;
    RTC_C->rTIM1.b.bHOUR = calendarTime->hours;
    RTC_C->rTIM1.b.bDOW = calendarTime->dayOfWeek;
    RTC_C->rDATE.b.bDAY = calendarTime->dayOfmonth;
    RTC_C->rDATE.b.bMON = calendarTime->month;
    RTC_C->rYEAR.r = calendarTime->year;

    BITBAND_PERI(RTC_C->rCTL0.r, RTCKEY_OFS) = 0;
}


RTC_C_Calendar RTC_C_getCalendarTime(void)
{
    RTC_C_Calendar tempCal;

    while (!(BITBAND_PERI(RTC_C->rCTL13.r, RTCRDY_OFS)))
        ;

    tempCal.seconds = RTC_C->rTIM0.b.bSEC;
    tempCal.minutes = RTC_C->rTIM0.b.bMIN;
    tempCal.hours = RTC_C->rTIM1.b.bHOUR;
    tempCal.dayOfWeek = RTC_C->rTIM1.b.bDOW;
    tempCal.dayOfmonth = RTC_C->rDATE.b.bDAY;
    tempCal.month = RTC_C->rDATE.b.bMON;
    tempCal.year = RTC_C->rYEAR.r;

    return (tempCal);
}


